{
  "place_id": "ChIJ6XYD2ZGAhYARhDX0sVfc6Cc",
  "name": "Millennium",
  "average_rating": 4.5,
  "total_reviews": 1190,
  "top_5_reviews": [
    {
      "author_name": "Shimeng",
      "rating": 4,
      "text": "One of the few higher-end vegan places in the Bay area.  This is my first time here.  I don't think I will make another reservation and drive one and a half hours from the South Bay to eat here.  That being said, it is a solid choice for a nice all vegan experience.  It's just probably not the best value for money (and time, if you are coming from more than 30 minutes away).  All the dishes are well executed, but nothing to write home about other than it was full vegan.  I do like that they source local ingredients and keep a rotating seasonal menu.  The desserts are very well done, a good amount of tartness to make it feel like a nice light ending for the meal. The place is also a bit crowded and noisy for the money charged per person.",
      "relative_time": "2 weeks ago"
    },
    {
      "author_name": "Daniel Wang",
      "rating": 5,
      "text": "Came here for Oakland restaurant week and pleasantly surprised. Truffle vodka pasta was the highlight. Discovered vegan coconut toasted “bacon” for the first time and was blown away but the subtleties (like added crunch textures and slight sweet/tart/spice flavors)that make the dishes stand out.",
      "relative_time": "a month ago"
    },
    {
      "author_name": "Shivakshi Gupta",
      "rating": 1,
      "text": "I visited this fine-dining vegan restaurant for the first time on my birthday, hoping for a memorable experience. Unfortunately, it turned out to be one of the most disappointing dining experiences I’ve ever had. I have been vegan for nine years, and having both cooked flavorful meals and dined at numerous vegan establishments, I can confidently say that vegan food is generally delicious and satisfying. However, for the first time, I found myself eagerly waiting for a meal to end just so I could leave. I rarely waste food, but this was one of those rare occasions.\n\nFood:\n\nThe focaccia was extremely dry.\n\nThe soup was a 1/5—completely unpalatable, and I couldn’t finish it.\n\nThe kofta was also dry, and the glazed tempeh was, unfortunately, the worst dish I have ever tasted.\n\nAs someone from India, I am familiar with traditional kofta and uttapam, and these versions were far from authentic or enjoyable. The uttapam was dry and, at best, a 2/5.\n\nTo make matters worse, I found a lemon seed in my food—completely unacceptable at a fine-dining establishment.\n\nThe only redeeming item was the dessert, which I would rate a 4/5.\n\nService:\n\nThe service was sluggish and unprofessional. Despite having a reservation, we were seated approximately 30 minutes late. While that was understandable, the delays in serving each course were excessive, diminishing the overall dining experience.\n\nThe staff did not replace cutlery properly between courses. After the first course, my fork and knife were taken away, but no replacements were provided for the next course.\n\nNo soup spoon was given, which was surprising for a restaurant of this caliber.\n\nPerhaps the most unexpected part was receiving the bill immediately after dessert was served—before we had even finished eating.\n\nSince we were sitting on the patio and a heater went out, they did offer a blanket.\n\nAmbience:\n\nThe ambience was decent. The patio furniture, however, was not well-maintained and felt slightly unclean, though the lighting was decent.\n\nFinal Thoughts:\n\nThis experience was underwhelming in every aspect for—food, and service. Finding a lemon seed in my food further highlighted the lack of attention to detail. Given the restaurant’s reputation, I expected much more, but unfortunately, it fell short in every way.\n\nI would not recommend it.",
      "relative_time": "2 months ago"
    },
    {
      "author_name": "Linda Brandt",
      "rating": 5,
      "text": "Our Fall Harvest (Thanksgiving) dinner at Millennium was delightful. As long-time vegetarians, we've had our share of lackluster holiday meals, but Millennium exceeded our expectations.\n\nThe mushroom torte was a particular standout. The vegetables were perfectly cooked, and the flavors were exceptional. Our server, Steven, who is also a chef, offered insightful recommendations that enhanced our dining experience.\n\nThe restaurant's ambiance was warm and inviting, making it the perfect setting for a special occasion. We highly recommend Millennium to anyone seeking a memorable dining experience.",
      "relative_time": "5 months ago"
    },
    {
      "author_name": "Vincent Wilson",
      "rating": 5,
      "text": "The best vegan food that I have had! The food is fresh and the menu is creative. Highly recommend that you check them out.",
      "relative_time": "2 months ago"
    }
  ]
}